app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
---
  def index

    if (params[:artist_id])&(Artist.find(params[:artist_id]))